{
  "name": "Kh.Kim",
  "summary": "I’m Kihwan Kim, a Frontend Engineer. At RIDI, I worked on large-scale content platforms, focusing on structural improvements and user experience optimization. Currently, at Levvels, a subsidiary of Dunamu, I continue to enhance frontend architecture and design interaction layers for commerce-oriented services. During my master’s studies, I researched visual analytics and AI-driven interfaces, and I’ve since integrated that analytical mindset into practical frontend development to design flexible and scalable user experiences. My experience across both industry and academia has given me a balanced perspective — not only on technical craftsmanship but also on problem framing and cross-functional collaboration.",
  "present": "Present",
  "experience": [
    {
      "company": "Levvels",
      "role": "Frontend Engineer",
      "period": "Jul 2025–Present",
      "summary": "Owned the frontend for a new commerce service, refining structure and UX through cart and auth refactors, analytics and communication tooling, and standardized interactions.",
      "projects": [
        {
          "title": "Commerce Frontend Development",
          "period": "Jul 2025–Present",
          "summary": "Designed and developed the frontend architecture for Levvels’ new commerce platform, including creator-facing channel experiences.",
          "details": [
            "Implemented shopping cart and product detail pages alongside creator channel and post experiences with responsive layouts, accessibility improvements, and live end-user views",
            "Built an iframe-based real-time preview system covering both editor and published views"
          ]
        },
        {
          "title": "Design System & Interaction Standardization",
          "period": "Sep 2025–Present",
          "summary": "Standardized motion and MDC rules within the design system to ensure interaction consistency.",
          "details": [
            "Defined animation presets and transition rules within the design system",
            "Established MDC conventions for Cursor environment and component integration",
            "Collaborated with design team to document interaction guidelines"
          ]
        }
      ],
      "stack": [
        "React",
        "Next.js",
        "TypeScript",
        "Emotion",
        "Framer Motion"
      ]
    },
    {
      "company": "RIDI Corp.",
      "role": "Frontend Developer",
      "period": "May 2022–Jul 2025",
      "summary": "Introduced the RiGrid server-driven UI framework for RIDI’s 2.13M MAU content platform, enabling operator-led UI changes and faster experimentation.",
      "projects": [
        {
          "title": "RIDI Web Platform",
          "period": "May 2022–Jul 2025",
          "summary": "Designed and introduced the RiGrid server-driven UI framework to decouple UI delivery from client releases.",
          "details": [
            "Defined UI layouts and components declaratively on the server and rendered them on clients at runtime",
            "Eliminated deployment dependency for UI updates, allowing operators to manage configurations directly",
            "Reduced lead time for repetitive UI/content changes by over 50% based on operational workflows",
            "Maintained stability across devices for high-traffic content operations and rapid experimentation"
          ]
        }
      ],
      "stack": [
        "Next.js",
        "React",
        "TypeScript",
        "Emotion",
        "Jest",
        "PHP",
        "Twig"
      ]
    },
    {
      "company": "TmaxEnterprise",
      "role": "Research Engineer",
      "period": "Feb 2020–Apr 2022",
      "summary": "Migrated enterprise products from a jQuery-based stack to React and built interfaces for the company’s AutoML platform.",
      "aliases": [
        "Currently TmaxBizAI",
        "Formerly TmaxData"
      ],
      "projects": [
        {
          "title": "Legacy System React Migration",
          "period": "Jan 2021–Apr 2022",
          "summary": "Ported enterprise platform products from a jQuery-based internal library to React.",
          "details": [
            "Modularized legacy UI code and improved interface structure",
            "Developed reusable components to replace bespoke legacy widgets"
          ]
        },
        {
          "title": "AutoML Platform",
          "period": "Feb 2020–Apr 2022",
          "summary": "Built frontend and interaction patterns for the company’s AutoML platform.",
          "details": [
            "Implemented a codeless studio for non-expert model builders",
            "Developed explainable AI (XAI) visualizations and dashboards",
            "Researched interfaces to bridge AutoML engines and model developers"
          ]
        }
      ],
      "stack": [
        "React",
        "TypeScript",
        "Material-UI",
        "Sass",
        "Python",
        "jQuery"
      ]
    }
  ],
  "education": [
    {
      "institution": "Ulsan National Institute of Science and Technology (UNIST)",
      "degrees": [
        {
          "degree": "Master of Science in Computer Science",
          "period": "2018.03–2020.02"
        },
        {
          "degree": "Bachelor of Science in Technology Management (Multi-disciplinary major in Computer Science)",
          "period": "2013.03–2018.02"
        }
      ],
      "projects": [
        {
          "title": "AI-centered UI/UX Design",
          "period": "2019.01–2020.02",
          "description": "Conducted research to answer the question, 'How should the UI be designed to better collect user preference data?'",
          "points": [
            "Measured the impact of transparency on data quality in the explore-exploit problem of recommendation systems",
            "Proposed a metric to evaluate the value of user logs from an AI perspective",
            "Implemented a web-based movie recommendation system for experimental environments"
          ],
          "badges": [
            "Python",
            "Flask",
            "Surprise",
            "jQuery"
          ]
        },
        {
          "title": "Modeling Web User Behavior",
          "period": "2019.02–2020.02",
          "description": "Conducted research to understand and model user behavior patterns in web environments.",
          "points": [
            "Estimated user reward functions from behavior logs through Inverse Reinforcement Learning",
            "Dealt with various web environments such as data analysis tools like Tableau, history education tools based on Wikipedia documents, and card games",
            "Utilized data analysis tools such as Tableau and implemented a history education tool based on Wikipedia documents"
          ],
          "badges": [
            "Python",
            "TensorFlow",
            "Keras",
            "scikit-learn"
          ]
        }
      ]
    }
  ],
  "publications": [
    {
      "title": "An Empirical Analysis on Transparent Algorithmic Exploration in Recommender Systems",
      "uri": "https://arxiv.org/abs/2108.00151",
      "authors": [
        "Kihwan Kim"
      ],
      "conference": "A Computing Research Repository (CoRR), 2108.00151, 2021",
      "points": [
        "Investigated how to deliver random items to capture user preferences in recommendation systems",
        "Implemented a web-based movie recommendation system used as an experimental environment",
        "Proposed a metric to evaluate the value of user logs from an AI perspective",
        "Measured the impact of transparency on data quality in the explore-exploit problem of recommendation systems",
        "Recruited 94 participants from Amazon MTurk",
        "Collected real usage log data and survey responses by having participants use a Netflix-like experimental environment"
      ]
    },
    {
      "title": "ST-GRAT: A Novel Spatio-temporal Graph Attention Networks for Accurately Forecasting Dynamically Changing Road Speed",
      "uri": "https://dl.acm.org/doi/10.1145/3340531.3411940",
      "authors": [
        "Cheonbok Park",
        "Chunggi Lee",
        "Hyojin Bahng",
        "Yunwon Tae",
        "Kihwan Kim",
        "Seungmin Jin",
        "Sungahn Ko",
        "Jaegul Choo"
      ],
      "conference": "ACM International Conference on Information and Knowledge Management (CIKM), 2020",
      "points": [
        "Preprocessed vehicle detection sensor data installed on the road surface by Korea Expressway Corporation",
        "Categorized cases where attention worked effectively by patterns"
      ]
    },
    {
      "title": "Modeling Exploration/Exploitation Decisions through Mobile Sensing for Understanding Mechanisms of Addiction",
      "uri": "https://dl.acm.org/citation.cfm?doid=3307334.3328599",
      "authors": [
        "Kihwan Kim",
        "Sanghoon Kim",
        "Chunggi Lee",
        "Sungahn Ko"
      ],
      "conference": "ACM International Conference on Mobile Systems, Applications, and Services (MobiSys), 2019",
      "points": [
        "Proposed a system to detect addiction disorders from smartphone usage logs through Inverse Reinforcement Learning"
      ]
    },
    {
      "title": "An Empirical Study on the Relationship Between the Number of Coordinated Views and Visual Analysis",
      "uri": "https://arxiv.org/abs/2204.09524",
      "authors": [
        "Juyoung Oh",
        "Chunggi Lee",
        "Hwiyeon Kim",
        "Kihwan Kim",
        "Osang Kwon",
        "Eric D. Ragan",
        "Bum Chul Kwon",
        "Sungahn Ko"
      ],
      "conference": "A Computing Research Repository (CoRR), 2204.09524, 2018",
      "points": [
        "Conducted experiments to see how the number of visualization charts affects data visual analysis",
        "Had 44 participants use a visual analysis tool and solve data analysis tasks",
        "Categorized users' analysis patterns through think-aloud protocol, recorded screens, and log data",
        "Observed a positive correlation between the number of charts and task scores"
      ]
    },
    {
      "title": "A Survey of Visualization Techniques for Interpreting Deep Learning",
      "uri": "http://www.dbpia.co.kr/journal/articleDetail?nodeId=NODE07266060&language=ko_KR",
      "authors": [
        "Jaesung Lee",
        "Kihwan Kim",
        "Chunggi Lee",
        "Sungahn Ko"
      ],
      "conference": "Noise & Vibration, Vol.27 No.6, 2017.11",
      "points": [
        "Summarized and investigated visualization techniques for interpreting deep learning models"
      ]
    }
  ]
}
